PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
    /*Endpoint IN Descriptor*/
    0x07, /* bLength: Endpoint Descriptor size */
    USB_DESC_TYPE_ENDPOINT, /* bDescriptorType: Endpoint */
    CDC_IN_EP, /* bEndpointAddress */
    0x02, /* bmAttributes: Bulk */
    LOBYTE(CDC_DATA_FS_MAX_PACKET_SIZE), /* wMaxPacketSize: */
    HIBYTE(CDC_DATA_FS_MAX_PACKET_SIZE),
    0x00 /* bInterval: ignore for Bulk transfer */
};

__ALIGN_BEGIN uint8_t
    USBD_CDC_OtherSpeedCfgDesc[USB_CDC_CONFIG_DESC_SIZ] __ALIGN_END = {
        0x09, /* bLength: Configuation Descriptor size */
        USB_DESC_TYPE_OTHER_SPEED_CONFIGURATION, USB_CDC_CONFIG_DESC_SIZ, 0x00,
        0x02, /* bNumInterfaces: 2 interfaces */
        0x01, /* bConfigurationValue: */
        0x04, /* iConfiguration: */
        0xC0, /* bmAttributes: */
        0x32, /* MaxPower 100 mA */

        /*Interface Descriptor */
        0x09, /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE, /* bDescriptorType: Interface */
        /* Interface descriptor type */
        0x00, /* bInterfaceNumber: Number of Interface */
        0x00, /* bAlternateSetting: Alternate setting */
        0x01, /* bNumEndpoints: One endpoints used */
        0x02, /* bInterfaceClass: Communication Interface Class */
        0x02, /* bInterfaceSubClass: Abstract Control Model */
        0x01, /* bInterfaceProtocol: Common AT commands */
        0x00, /* iInterface: */

        /*Header Functional Descriptor*/
        0x05, /* bLength: Endpoint Descriptor size */
        0x24, /* bDescriptorType: CS_INTERFACE */
        0x00, /* bDescriptorSubtype: Header Func Desc */
        0x10, /* bcdCDC: spec release number */
        0x01,

        /*Call Management Functional Descriptor*/
        0x05, /* bFunctionLength */
        0x24, /* bDescriptorType: CS_INTERFACE */
        0x01, /* bDescriptorSubtype: Call Management Func Desc */
        0x00, /* bmCapabilities: D0+D1 */
        0x01, /* bDataInterface: 1 */

        /*ACM Functional Descriptor*/
        0x04, /* bFunctionLength */
        0x24, /* bDescriptorType: CS_INTERFACE */
        0x02, /* bDescriptorSubtype: Abstract Control Management desc */
        0x02, /* bmCapabilities */

        /*Union Functional Descriptor*/
        0x05, /* bFunctionLength */
        0x24, /* bDescriptorType: CS_INTERFACE */
        0x06, /* bDescriptorSubtype: Union func desc */
        0x00, /* bMasterInterface: Communication class interface */
        0x01, /* bSlaveInterface0: Data Class Interface */

        /*Endpoint 2 Descriptor*/
        0x07, /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT, /* bDescriptorType: Endpoint */
        CDC_CMD_EP, /* bEndpointAddress */
        0x03, /* bmAttributes: Interrupt */
        LOBYTE(CDC_CMD_PACKET_SIZE), /* wMaxPacketSize: */
        HIBYTE(CDC_CMD_PACKET_SIZE), CDC_FS_BINTERVAL, /* bInterval: */

        /*---------------------------------------------------------------------------*/

        /*Data class interface descriptor*/
        0x09, /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_INTERFACE, /* bDescriptorType: */
        0x01, /* bInterfaceNumber: Number of Interface */
        0x00, /* bAlternateSetting: Alternate setting */
        0x02, /* bNumEndpoints: Two endpoints used */
        0x0A, /* bInterfaceClass: CDC */
        0x00, /* bInterfaceSubClass: */
        0x00, /* bInterfaceProtocol: */
        0x00, /* iInterface: */

        /*Endpoint OUT Descriptor*/
        0x07, /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT, /* bDescriptorType: Endpoint */
        CDC_OUT_EP, /* bEndpointAddress */
        0x02, /* bmAttributes: Bulk */
        0x40, /* wMaxPacketSize: */
        0x00, 0x00, /* bInterval: ignore for Bulk transfer */

        /*Endpoint IN Descriptor*/
        0x07, /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT, /* bDescriptorType: Endpoint */
        CDC_IN_EP, /* bEndpointAddress */
        0x02, /* bmAttributes: Bulk */
        0x40, /* wMaxPacketSize: */
        0x00, 0x00 /* bInterval */
};

/**
 * @}
 */

/** @defgroup USBD_CDC_Private_Functions
 * @{
 */

/**
 * @brief  USBD_CDC_Init
 *         Initialize the CDC interface
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_CDC_Init(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    uint8_t ret = 0U;
    USBD_CDC_HandleTypeDef* hcdc;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        if (pdev->dev_speed == USBD_SPEED_HIGH)
        {
            /* Open EP IN */
            for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
            {
                uint8_t epAddr = fops->interfaceEpAddr[epIndex];
                uint8_t epAttr = fops->interfaceEpAttr[epIndex];
                if ((epAddr & 0x80U) != 0U)
                {  // IN endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_HS_IN_PACKET_SIZE);
                    pdev->ep_in[epAddr & 0xFU].is_used = 1U;
                }
                else
                {  // OUT endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_HS_OUT_PACKET_SIZE);
                    pdev->ep_out[epAddr & 0xFU].is_used = 1U;
                }
            }
        }
        else
        {
            /* Open EP IN */
            for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
            {
                uint8_t epAddr = fops->interfaceEpAddr[epIndex];
                uint8_t epAttr = fops->interfaceEpAttr[epIndex];
                if ((epAddr & 0x80U) != 0U)
                {  // IN endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_FS_IN_PACKET_SIZE);
                    pdev->ep_in[epAddr & 0xFU].is_used = 1U;
                }
                else
                {  // OUT endpoint
                    USBD_LL_OpenEP(pdev, epAddr, epAttr,
                                   CDC_DATA_FS_OUT_PACKET_SIZE);
                    pdev->ep_out[epAddr & 0xFU].is_used = 1U;
                }
            }
        }
    }
    /* Open Command IN EP */
    // USBD_LL_OpenEP(pdev, CDC_CMD_EP, USBD_EP_TYPE_INTR, CDC_CMD_PACKET_SIZE);
    // pdev->ep_in[CDC_CMD_EP & 0xFU].is_used = 1U;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        pdev->pClassData[i] = USBD_malloc(sizeof(USBD_CDC_HandleTypeDef));
        if (pdev->pClassData[i] == NULL)
        {
            ret = 1U;
        }
        else
        {
            hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[i];

            /* Init  physical Interface components */
            ((USBD_CDC_ItfTypeDef*)pdev->pUserData[i])->Init();

