PureBulb/stm32_CompositeDevice/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c
            /* Init Xfer states */
            hcdc->TxState = 0U;
            hcdc->RxState = 0U;
            USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
            if (pdev->dev_speed == USBD_SPEED_HIGH)
            {
                /* Prepare Out endpoint to receive next packet */
                for (uint8_t epIdx = 0; epIdx < fops->endpointSize; epIdx++)
                {
                    uint8_t epAddr = fops->interfaceEpAddr[epIdx];
                    if ((epAddr & 0x80U) == 0U)
                    {  // OUT endpoint
                        USBD_LL_PrepareReceive(pdev, epAddr, hcdc->RxBuffer,
                                               CDC_DATA_HS_OUT_PACKET_SIZE);
                    }
                }
            }
            else
            {
                /* Prepare Out endpoint to receive next packet */
                for (uint8_t epIdx = 0; epIdx < fops->endpointSize; epIdx++)
                {
                    uint8_t epAddr = fops->interfaceEpAddr[epIdx];
                    if ((epAddr & 0x80U) == 0U)
                    {  // OUT endpoint
                        USBD_LL_PrepareReceive(pdev, epAddr, hcdc->RxBuffer,
                                               CDC_DATA_FS_OUT_PACKET_SIZE);
                    }
                }
            }
        }
    }
    return ret;
}

/**
 * @brief  USBD_CDC_Init
 *         DeInitialize the CDC layer
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_CDC_DeInit(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    uint8_t ret = 0U;
    for (uint8_t i = 0; i < pdev->interfaceSize; i++)
    {
        USBD_CDC_ItfTypeDef* fops = pdev->pUserData[i];
        for (uint8_t epIndex = 0; epIndex < fops->endpointSize; epIndex++)
        {
            uint8_t epAddr = fops->interfaceEpAddr[epIndex];
            /* Close EP */
            USBD_LL_CloseEP(pdev, epAddr);
            if ((epAddr & 0x80U) != 0U)
            {
                pdev->ep_in[epAddr & 0xFU].is_used = 0U;
            }
            else
            {
                pdev->ep_out[epAddr & 0xFU].is_used = 0U;
            }
        }
        if (pdev->pClassData[i] != NULL)
        {
            ((USBD_CDC_ItfTypeDef*)pdev->pUserData[i])->DeInit();
            USBD_free(pdev->pClassData[i]);
            pdev->pClassData[i] = NULL;
        }
    }
    /* DeInit  physical Interface components */
    return ret;
}

/**
 * @brief  USBD_CDC_Setup
 *         Handle the CDC specific requests
 * @param  pdev: instance
 * @param  req: usb requests
 * @retval status
 */
static int8_t CDC_GetInterfaceIndexFromSetup(USBD_HandleTypeDef *pdev,
    USBD_SetupReqTypedef *req)
{
uint8_t recipient = req->bmRequest & 0x1F;   // 低 5 位 = Recipient

switch (recipient)
{
case USB_REQ_RECIPIENT_INTERFACE: {
uint8_t if_num = (uint8_t)(req->wIndex & 0xFF);
return USBD_CDC_GetInterfaceIndexByIfNum(pdev, if_num);
}

case USB_REQ_RECIPIENT_ENDPOINT: {
uint8_t ep_addr = (uint8_t)(req->wIndex & 0xFF);
return USBD_CDC_GetInterfaceIndexByEpNum(pdev, ep_addr);
}

default:
// 既不是 interface 也不是 endpoint，就没有对应 CDC interface
return -1;
}
}
static uint8_t USBD_CDC_Setup(USBD_HandleTypeDef* pdev,
                              USBD_SetupReqTypedef* req)
{

    int8_t interfaceIndex = CDC_GetInterfaceIndexFromSetup(pdev, req);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    uint8_t ifalt = 0U;
    uint16_t status_info = 0U;
    uint8_t ret = USBD_OK;

    switch (req->bmRequest & USB_REQ_TYPE_MASK)
    {
        case USB_REQ_TYPE_CLASS:
            if (req->wLength)
            {
                if (req->bmRequest & 0x80U)
                {
                    ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
                        ->Control(req->bRequest, (uint8_t*)(void*)hcdc->data,
                                  req->wLength);

                    USBD_CtlSendData(pdev, (uint8_t*)(void*)hcdc->data,
                                     req->wLength);
                }
                else
                {
                    hcdc->CmdOpCode = req->bRequest;
                    hcdc->CmdLength = (uint8_t)req->wLength;

                    USBD_CtlPrepareRx(pdev, (uint8_t*)(void*)hcdc->data,
                                      req->wLength);
                }
            }
            else
            {
                ((USBD_CDC_ItfTypeDef*)pdev->pUserData[interfaceIndex])
                    ->Control(req->bRequest, (uint8_t*)(void*)req, 0U);
            }
            break;

        case USB_REQ_TYPE_STANDARD:
            switch (req->bRequest)
            {
                case USB_REQ_GET_STATUS:
                    if (pdev->dev_state == USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlSendData(pdev, (uint8_t*)(void*)&status_info,
                                         2U);
                    }
                    else
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                case USB_REQ_GET_INTERFACE:
                    if (pdev->dev_state == USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlSendData(pdev, &ifalt, 1U);
                    }
                    else
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                case USB_REQ_SET_INTERFACE:
                    if (pdev->dev_state != USBD_STATE_CONFIGURED)
                    {
                        USBD_CtlError(pdev, req);
                        ret = USBD_FAIL;
                    }
                    break;

                default:
                    USBD_CtlError(pdev, req);
                    ret = USBD_FAIL;
                    break;
            }
            break;

        default:
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
            break;
    }

    return ret;
}

/**
 * @brief  USBD_CDC_DataIn
 *         Data sent on non-control IN endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_CDC_DataIn(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }

    USBD_CDC_HandleTypeDef* hcdc =
        (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];
    PCD_HandleTypeDef* hpcd = pdev->pData;

    if (pdev->pClassData[interfaceIndex] != NULL)
    {
        if ((pdev->ep_in[epnum].total_length > 0U) &&
            ((pdev->ep_in[epnum].total_length % hpcd->IN_ep[epnum].maxpacket) ==
             0U))
        {
            /* Update the packet total length */
            pdev->ep_in[epnum].total_length = 0U;

            /* Send ZLP */
            USBD_LL_Transmit(pdev, epnum, NULL, 0U);
        }
        else
        {
            hcdc->TxState = 0U;
        }
        return USBD_OK;
    }
    else
    {
        return USBD_FAIL;
    }
}

/**
 * @brief  USBD_CDC_DataOut
 *         Data received on non-control Out endpoint
 * @param  pdev: device instance
 * @param  epnum: endpoint number
 * @retval status
 */
static uint8_t USBD_CDC_DataOut(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
      int8_t interfaceIndex = USBD_CDC_GetInterfaceIndexByEpNum(pdev, epnum);
    if (interfaceIndex < 0)
    {
        return USBD_FAIL;
    }
    USBD_CDC_HandleTypeDef* hcdc = (USBD_CDC_HandleTypeDef*)pdev->pClassData[interfaceIndex];

